Revit 2026 API

# AlignedFreeFormSetOrientationOptions Enumeration

---

Orientation options for Aligned Free Form Rebar set.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum AlignedFreeFormSetOrientationOptions
```
```vb
Public Enumeration AlignedFreeFormSetOrientationOptions
```
```cpp
public enum class AlignedFreeFormSetOrientationOptions
```
```fsharp
type AlignedFreeFormSetOrientationOptions
```

| Member name | Value | Description |
| --- | --- | --- |
| AlignedToDistributionPath | 0 | Cutting planes are perpendicular to the distribution path. |
| ParallelToFace | 2 | Cutting planes are parallel to a selected planar face. |
| PerpendicularToFace | 3 | Cutting planes are oriented perpendicular to a selected planar face, X or Y vector being the face normal. |
| Vertical | 1 | Cutting planes are oriented vertically, X or Y vector being Z axis. |

#### Reference

Autodesk.Revit.DB.Structure Namespace